{
  "shared": {
    "antoineZanardi": "Antoine Zanardi",
    "months": "{monthCount} mois",
    "years": "{yearCount} an | {yearCount} ans",
    "and": "et",
    "today": "Aujourd'hui"
  },
  "MyProfile": {
    "profilePicture": "Photo de profil",
    "itConsultant": "Consultant en Informatique",
    "fullStackWebExpert": "Expert Web FullStack",
    "cv": "CV",
    "myCv": "Mon CV",
    "joinMyNetwork": "Rejoignez mon réseau",
    "discoverMyProjects": "Découvrez mes projets"
  },
  "AboutMe": {
    "whoAmI": "Qui suis-je?",
    "welcomeOnMyProfile": "Hello {emoji} ! Je suis <b>Antoine Zanardi</b> et bienvenue sur mon profil. Je suis <b> expert informatique spécialisé dans le web</b> et passionné par les nouvelles technologies, la robotique, l'intelligence artificielle et les innovations en tout genre.",
    "myDiplomas": "Mes diplômes acquis pendant",
    "myEducation": "mon cursus scolaire",
    "bindWith": "couplés à",
    "myExperience": "mon parcours professionnel",
    "giveMeManagementAndTechnicalSkills": "me permettent d'avoir un <b> esprit d'équipe </b> fort ainsi que des compétences <b> techniques et managériales</b> avancées.",
    "myPassionAndPerfectionism": "Ma passion et mon perfectionnisme me poussent à aller au bout de mes projets en y apportant <b>ma rigueur et mon savoir</b> pour les terminer dans les temps et dans<b> la qualité attendue</b>.",
    "myTechnologyWatch": "Ma veille technologique me permet d'être à la page sur les nouveautés du web et de les appliquer dans mes projets.",
    "personalInfo": "Informations personnelles",
    "genre": "Sexe",
    "male": "Homme",
    "age": "Age",
    "yearsOld": "{age} ans",
    "email": "email",
    "phone": "Téléphone",
    "address": "Adresse postale",
    "languages": "Langues",
    "englishAndFrench": "Anglais et Français",
    "licenses": "Permis",
    "car": "Voiture",
    "boat": "Bateau",
    "workingAt": "Travaille chez"
  },
  "MySkills": {
    "itSkills": "Compétences techniques",
    "html": "HTML",
    "css": "CSS",
    "javascript": "Javascript",
    "typescript": "Typescript",
    "vue": "Vue 3",
    "nuxt": "Nuxt 3",
    "mysql": "MySQL",
    "mongodb": "MongoDB",
    "myTools": "Mes outils",
    "hoverIconsForDetails": "Survolez les icônes pour plus de détails",
    "linuxForServers": "Je déploie mes travaux web sur des serveurs sous Linux (Debian). Je m'occupe moi-même de la configuration de l'hébergement des applications sur le serveur grâce à une CI/CD robuste.",
    "microServicesArchitecture": "J'organise mes applications Web en micro-services : les API(s) communiquent avec l'interface pour la servir à chaque demande des utilisateurs. Tout est séparé en galaxie de services.",
    "gitForVersionControl": "J'utilise Git pour le version control de mes projets.",
    "multipleEnvs": "Pour tous mes projets, je mets en place plusieurs environnements (une production couplée à une pré-production au minimum) grâce au système de branches de Git et des flows séparés de CI/CD.",
    "gitHubAndActions": "Je travaille sur GitHub et utilise GitHub Actions comme outil de CI/CD pour tester le code et déployer les productions, tout cela de manière automatisée et sécurisée.",
    "nodeJsForProjects": "NodeJS est un environnement indispensable pour tous mes projets en Typescript. Je l'utilise à la fois pour mes APIs et mes interfaces web.",
    "cssFrameworks": "Je maîtrise plusieurs frameworks de design comme Bootstrap, MaterializeCSS ou encore Font Awesome pour parfaire mes interfaces.",
    "vueJsWithNuxt": "J'utilise le framework VueJS 3 couplé à NuxtJS 3 pour construire l'interface web de mes projets, allant de simples sites vitrines à des backoffices complets et ergonomiques.",
    "openSourceNpm": "Je soutiens l'open-source en intégrant des modules NPM à mes projets. Je suis leurs prochaines releases sur GitHub.",
    "esLintForGoodPractises": "Mon code est soumis à une norme stricte (W3School pour HTML et ESLint pour JS / TS / Vue) afin qu'il reste maintenable, homogène et lisible.",
    "unitTests": "Je m'efforce d'écrire le maximum de tests unitaires et E2E sur mes projets afin de prouver leur robustesse."
  },
  "MyPortfolio": {
    "portfolio": "Portfolio",
    "projects": {
      "portfolio": {
        "name": "Mon portfolio",
        "description": "Présentation de mon travail"
      },
      "werewolvesAssistant": {
        "name": "Assistant Loups-Garous",
        "description": "L'outil idéal pour le maître du jeu des Loups-Garous de Thiercelieux™"
      },
      "distribution": {
        "name": "Boutique de livres",
        "description": "Boutique en ligne de distribution de livres"
      },
      "gitHub": {
        "name": "Découvrez mes autres projets",
        "description": "Et n'hésitez pas à me suivre sur GitHub !"
      }
    }
  },
  "MyExperience": {
    "professionalExperience": "Expérience professionnelle"
  }
}