{
  "shared": {
    "antoineZanardi": "Antoine Zanardi",
    "months": "{monthCount} mois",
    "years": "{yearCount} an | {yearCount} ans",
    "and": "et",
    "today": "aujourd'hui"
  },
  "Languages": {
    "french": "Français",
    "english": "Anglais"
  },
  "App": {
    "meta": {
      "description": "Portfolio d'Antoine ZANARDI, expert informatique spécialisé dans le web regroupant CV, projets et compétences",
      "smallDescription": "Antoine ZANARDI, expert informatique spécialisé dans le web"
    }
  },
  "MyProfile": {
    "profilePicture": "Photo de profil",
    "itConsultant": "Consultant Tech Lead",
    "fullStackWebExpert": "Expert Web FullStack",
    "cv": "CV",
    "myCv": "Mon CV"
  },
  "AboutMyPersonalInfo": {
    "personalInfo": "Informations personnelles",
    "genre": "Sexe",
    "male": "Homme",
    "age": "Age",
    "yearsOld": "{age} ans",
    "email": "email",
    "phone": "Téléphone",
    "address": "Adresse postale",
    "languages": "Langues",
    "englishAndFrench": "Anglais et Français",
    "licenses": "Permis",
    "car": "Permis B",
    "boat": "Permis Bateau Côtier",
    "workingAt": "Travaille chez",
    "emailLink": "Envoyez-moi un email à {email}",
    "phoneLink": "Appelez-moi au {phone}",
    "companyLink": "Visitez le site de {company}"
  },
  "AboutMyProfile": {
    "whoAmI": "Qui suis-je ?",
    "welcomeOnMyProfile": "Hello {emoji} ! Je suis <b>Antoine Zanardi</b> et bienvenue sur mon profil. Je suis <b> expert informatique spécialisé dans le web</b> et passionné par les nouvelles technologies, la robotique, l'intelligence artificielle et les innovations en tout genre.",
    "myDiplomas": "Mes diplômes acquis pendant",
    "myEducation": "mon cursus scolaire",
    "bindWith": "couplés à",
    "myExperience": "mon parcours professionnel",
    "giveMeManagementAndTechnicalSkills": "me permettent d'avoir un <b> esprit d'équipe </b> fort ainsi que des compétences <b> techniques et managériales</b> avancées.",
    "myPassionAndPerfectionism": "Ma passion et mon perfectionnisme me poussent à aller au bout de mes projets en y apportant <b>ma rigueur et mon savoir</b> pour les terminer dans les temps et dans<b> la qualité attendue</b>.",
    "myTechnologyWatch": "Ma veille technologique me permet d'être à la page sur les nouveautés du web et de les appliquer dans mes projets."
  },
  "MySkills": {
    "itSkills": "Compétences techniques",
    "html": "HTML",
    "css": "CSS",
    "javascript": "JavaScript",
    "typescript": "TypeScript",
    "vue": "Vue 3",
    "nuxt": "Nuxt 3",
    "mysql": "MySQL",
    "mongodb": "MongoDB",
    "rust": "Rust",
    "myTools": "Mes outils",
    "hoverIconsForDetails": "Survolez ou cliquez sur les icônes pour plus de détails",
    "linuxForServers": "Je déploie mes travaux web sur des serveurs sous Linux (Debian). Je m'occupe moi-même de la configuration de l'hébergement des applications sur le serveur grâce à une CI/CD robuste.",
    "microServicesArchitecture": "J'organise mes applications Web en micro-services : les API(s) communiquent avec l'interface pour la servir à chaque demande des utilisateurs. Tout est séparé en galaxie de services.",
    "gitForVersionControl": "J'utilise Git pour le version control de mes projets.",
    "multipleEnvs": "Pour tous mes projets, je mets en place plusieurs environnements (une production couplée à une pré-production au minimum) grâce au système de branches de Git et des flows séparés de CI/CD.",
    "gitHubAndActions": "Je travaille sur GitHub et utilise GitHub Actions comme outil de CI/CD pour tester le code et déployer les productions, tout cela de manière automatisée et sécurisée.",
    "nodeJsForProjects": "NodeJS est un environnement indispensable pour tous mes projets en Typescript. Je l'utilise à la fois pour mes APIs et mes interfaces web.",
    "cssFrameworks": "Je maîtrise plusieurs frameworks de design comme Bootstrap, MaterializeCSS ou encore Font Awesome pour parfaire mes interfaces.",
    "vueJsWithNuxt": "J'utilise le framework VueJS 3 couplé à NuxtJS 3 pour construire l'interface web de mes projets, allant de simples sites vitrines à des backoffices complets et ergonomiques.",
    "openSourceNpm": "Je soutiens l'open-source en intégrant des modules NPM à mes projets. Je suis leurs prochaines releases sur GitHub.",
    "esLintForGoodPractises": "Mon code est soumis à une norme stricte (W3School pour HTML et ESLint pour JS / TS / Vue) afin qu'il reste maintenable, homogène et lisible.",
    "unitTests": "Je m'efforce d'écrire le maximum de tests unitaires et E2E sur mes projets afin de prouver leur robustesse.",
    "docker": "Je déploie mes applications dans des conteneurs Docker pour garantir une portabilité et une sécurité maximale.",
    "openSource": "Je suis un ferveur défenseur de l'open-source et je contribue régulièrement à des projets qui me tiennent à coeur."
  },
  "MyPortfolio": {
    "portfolio": "Portfolio",
    "projects": {
      "portfolio": {
        "name": "Mon portfolio",
        "description": "Présentation de mon travail"
      },
      "werewolvesAssistant": {
        "name": "Assistant Loups-Garous",
        "description": "L'outil idéal pour le maître du jeu des Loups-Garous de Thiercelieux™"
      },
      "distribution": {
        "name": "Boutique de livres",
        "description": "Boutique en ligne de distribution de livres"
      },
      "gitHub": {
        "name": "Découvrez mes autres projets",
        "description": "Et n'hésitez pas à me suivre sur GitHub !"
      }
    }
  },
  "MyExperience": {
    "professionalExperience": "Expérience professionnelle",
    "itR&DEngineer": "Ingénieur Recherche & Développement Informatique",
    "internFullStackDeveloper": "Stagiaire Développeur Web Full-Stack",
    "freelanceFullStackDeveloper": "Auto-Entrepreneur Développeur Web Full-Stack",
    "fullStackDeveloperConsultant": "Consultant Tech Lead Web Full-Stack",
    "firstInternship": "Durant mon tout premier stage en tant que développeur web, j'ai eu la responsabilité de développer le module de stocks des livres produits par l'entreprise de A à Z. Par la suite, j'ai maintenu ce module tout en apportant mon aide sur les autres projets de l'équipe informatique.",
    "reiterateAsFreelance": "Ma première mission chez SoBook ayant été enrichissante, j'ai décidé de la réitérer pendant 1 an en tant qu'auto-entrepreneur.",
    "moreResponsibilities": "Mes responsabilités se sont vite multipliées : améliorer et maintenir mon module de stocks, créer une interface de traduction, assister les autres développeurs dans leurs projets et bien plus.",
    "firstStepsInOhMyCode": "Première expérience dans la toute nouvelle branche informatique de SoBook, ma principale mission était de penser et développer un système de gestion de projets et de clients, un système de résolution de tickets et un agenda inter-développeurs.",
    "allFunctionalitiesInOnApp": "Toutes ces fonctionnalités se regroupent dans une seule et même application web.",
    "distributionProject": "Durant ce stage d’un an, la société m’a confié la responsabilité de grands projets comme la réalisation d’une boutique de distribution de livres à l’international. J’ai réalisé ces projets de bout en bout et en équipe, en participant à l'élaboration de leur cahier des charges, en planifiant les tâches à réaliser et bien évidemment, en développant chacune des parties en m’assurant que le client final soit satisfait.",
    "thisFinalInternship": "Ce stage de fin d’études a permis de valider mes compétences d’expert informatique auprès de la société, l’EPITECH et moi-même.",
    "firstPermanentContract": "Suite logique après mes nombreux stages dans la société, j'ai décroché un CDI en sortant de l'école et rejoint définitivement l'équipe en tant qu'ingénieur en R&D et développeur Full Stack. Aujourd'hui, je possède de nombreuses casquettes : chef de projet, développeur full-stack, maquetteur, testeur, reviewer... J'accompagne chacun de mes clients avec mon expertise tout en les guidant sur la meilleure marche à suivre pour faire évoluer au mieux leur(s) projet(s).",
    "asProjectManager": "En tant que chef de projet, je privilégie mon équipe en entretenant leur cohésion et en appliquant une répartition des tâches suivant les capacités et compétences de chacun, tout en écoutant leurs besoins, techniques ou humains.",
    "softSkills": "Je priorise de même les débuts d'un projet : une écoute attentive du besoin client, une période suffisante de réflexion des flux et une gestion des risques complète sont pour moi les points clefs pour démarrer correctement un projet. Les fondations doivent être les plus solides possible.",
    "expertiseAndTechnicalSkills": "En tant que développeur, j'applique mon expertise et ma technicité toutes deux apprises durant mon cursus pour livrer des fonctionnalités robustes, ergonomiques et en phase avec le besoin client. J'essaye sans cesse de remettre en question mes idées afin d'évoluer et de ne pas m'enfermer dans ma zone de confort.",
    "iJoinedDaveo": "Après avoir fait mes armes chez SoBook dans les technologies du web, j’ai rejoint l’ESN Daveo afin de proposer à leurs clients mon expertise Full-Stack Web en tant que consultant et développeur sénior.",
    "whatIsConsulting": "Le consulting chez ces grands groupes comme Norauto, Décathlon ou Kiabi me permet de découvrir et me familiariser avec les architectures complexes et avancées mises en place depuis plusieurs années maintenant. Je m’adapte aux système existants tout en étant force de proposition dans mes rapports de consultant pour les faire évoluer.",
    "myMissionsAsConsultant": "Mes missions se résument en trois points majeurs : industrialiser la codebase pour accroître la vélocité de développement, sécuriser les projets en run en appliquant les bonnes pratiques du métier et enfin pousser au maximum le travail d’équipe en suivant la méthodologie Agile qui a su faire ses preuves dans le développement informatique.",
    "cloudProductCertifications": "En parallèle, Daveo m’offre la possibilité de passer des certifications dans le Cloud Product Management : AWS, GCP, Azure ou encore Kubernetes. Je peux ainsi étendre mes compétences dans le DevOps et proposer une expertise encore plus complète aux clients.",
    "conferenceAndWorkshops": "J'organise régulièrement des conférences et des workshops à la fois pour les clients de Daveo et pour les consultants de l'entreprise. Ces événements me permettent de partager mes connaissances et de les transmettre à un plus grand nombre de personnes, tout en apprenant de nouvelles techniques et méthodes de travail."
  },
  "Schools": {
    "google": "Google",
    "cloudNativeComputingFoundation": "Cloud Native Computing Foundation",
    "laval": "Université Laval",
    "epitech": "Epitech",
    "vimeu": "Lycée du Vimeu"
  },
  "Degrees": {
    "gcpACE": "Google Associate Cloud Engineer (ACE)",
    "CKAD": "Certified Kubernetes Application Developer (CKAD)",
    "ITMasterDegree": "Master en Informatique - Titre d'Expert",
    "ITCertification": "Certificat en Technologies de l'Information (Double diplôme)",
    "highSchoolDiploma": "Baccalauréat Scientifique"
  },
  "Countries": {
    "usa": "États-Unis",
    "france": "France",
    "canada": "Canada"
  },
  "MyEducation": {
    "education": "Formation & Certifications",
    "scientistHighSchoolDiploma": "Obtention du BAC S, option européenne Anglais et mention Très Bien.",
    "internationalExperienceForManagement": "Expérience internationale pour obtenir un certificat sur mesure en technologie de l'information avec acquisition de compétences en marketing, gestion de projet et comportement organisationnel.",
    "softManagementSkills": "Ces études à l'étranger m'ont aussi permis d'élargir mes compétences de ma formation purement technique de l’EPITECH.",
    "firstThreeYearsInEpitech": "Mes 3 premières années à Epitech m'ont permis de découvrir de nombreux langages de programmation: C, C++, PHP, JavaScript, Python, Java... Cette école m'a appris à gérer un projet, manager une équipe et réaliser un travail atteignant les qualités attendues par un client.",
    "lastYearsInEpitech": "Durant mes 2 dernières années, j'ai travaillé sur mon projet de fin d'études qui m'a emmené au CES de Las Vegas 2017 pour le présenter en tant que grand projet d'aide aux sans-abris.",
    "kubernetesCertification": "Grâce à la certification CKAD, je peux conseiller mes clients dans leur architecture Kubernetes, mettre en place ou améliorer leurs clusters et les accompagner dans leur besoins DevOps.",
    "gcpACECertification": "Pour continuer mon apprentissage de l'univers du DevOps, j'ai obtenu la certification Google ACE pour connaître et maîtriser chacun des produits de leur univers Cloud."
  },
  "GitHubButton": {
    "discoverMyProjects": "Découvrez mes projets"
  },
  "LinkedInButton": {
    "joinMyNetwork": "Rejoignez mon réseau"
  },
  "SkillProgressBar": {
    "skillProgress": "Je maîtrise la technologie {skillName} à {skillPercent}"
  },
  "PeriodTimeline": {
    "periodDatesAriaLabel": "Période : {startedAt} à {finishedAt}",
    "obtainedAtAriaLabel": "Obtenu en {obtainedAt}"
  },
  "EducationDegreeCard": {
    "degreeObtainedAtAriaLabel": "{degreeName} obtenu en {obtainedAt}"
  },
  "NavBar": {
    "openNavigation": "Ouvrir la navigation"
  }
}